source/_static/diagrams/01-an-easyconfig-is-python-2.d2
direction: right
n0: ".eb file"
n1: "Python namespace"
n2: "evaluate"
n3: "name string"
n4: "easyblock class"
n5: "SYSTEM is a dict"
n6: "'tools' is a string"
n0 -> n1 -> n2
n2 -> n3 -> n4
n2 -> n5
n2 -> n6
